# YOLO26n adaptive detail-aware gated Swin context variant.
# The stock CNN backbone remains unchanged. Detail-aware adaptive Swin fusion is applied to P4 and P5.

nc: 5
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6 P4
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10 P5

head:
  - [6, 1, AdaptiveDetailGatedSwinFusion, [128, 64, 2, 7, 1, 4.0]] # 11 adaptive gated P4
  - [10, 1, AdaptiveDetailGatedSwinFusion, [256, 128, 4, 7, 2, 4.0]] # 12 adaptive gated P5

  - [12, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 11], 1, Concat, [1]] # 14 cat adaptive gated P4
  - [-1, 2, C3k2, [512, True]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  - [[-1, 4], 1, Concat, [1]] # 17 cat backbone P3
  - [-1, 2, C3k2, [256, True]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 19
  - [[-1, 15], 1, Concat, [1]] # 20 cat head P4
  - [-1, 2, C3k2, [512, True]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 22
  - [[-1, 12], 1, Concat, [1]] # 23 cat adaptive gated P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]] # 25 Detect(P3, P4, P5)
