# YOLO26-style detector with pure timm Swin-T backbone and P2 -> P3 detail injection.
# The Detect head remains 3-scale: Detect(P3, P4, P5).
#
# This keeps Swin-T patch_size=4 for pretrained compatibility, uses stage0
# stride-4 features only as a high-resolution detail source, and avoids adding
# a fourth Detect branch.

nc: 5

backbone:
  - [-1, 1, TorchVision, [768, swin_tiny_patch4_window7_224, True, [0, 1, 2, 3]]]

head:
  # Swin backbone outputs (P2, P3, P4, P5)
  - [0, 1, Index, [96, 0]] # 1: P2/4
  - [0, 1, Index, [192, 1]] # 2: P3/8
  - [0, 1, Index, [384, 2]] # 3: P4/16
  - [0, 1, Index, [768, 3]] # 4: P5/32

  # P2 -> P3 detail injection
  - [1, 1, Conv, [96, 3, 2]] # 5: P2_down/8
  - [[-1, 2], 1, Concat, [1]] # 6: concat P2_down + P3
  - [-1, 2, C2f, [192]] # 7: P3_enhanced/8

  # Top-down FPN path
  - [4, 1, nn.Upsample, [None, 2, "nearest"]] # 8
  - [[-1, 3], 1, Concat, [1]] # 9
  - [-1, 2, C2f, [384]] # 10

  - [10, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 7], 1, Concat, [1]] # 12
  - [-1, 2, C2f, [192]] # 13 (P3/8-small)

  # Bottom-up PAN path
  - [13, 1, Conv, [192, 3, 2]] # 14
  - [[-1, 10], 1, Concat, [1]] # 15
  - [-1, 2, C2f, [384]] # 16 (P4/16-medium)

  - [16, 1, Conv, [384, 3, 2]] # 17
  - [[-1, 4], 1, Concat, [1]] # 18
  - [-1, 2, C2f, [768]] # 19 (P5/32-large)

  - [[13, 16, 19], 1, Detect, [nc]]
