# YOLO26-style detector with a pure timm Swin-T backbone and 4-scale P2/P3/P4/P5 head.
# The `TorchVision` symbol is monkey-patched by scripts/train_swin.py to point
# to custom_models.SwinTBackbone via `--backbone-variant swin_t`.
#
# This variant keeps Swin-T patch_size=4 for pretrained compatibility and adds
# the stage0 stride-4 feature map as a small-object P2 detection level.

nc: 5

backbone:
  - [-1, 1, TorchVision, [768, swin_tiny_patch4_window7_224, True, [0, 1, 2, 3]]]

head:
  # Swin backbone outputs (P2, P3, P4, P5)
  - [0, 1, Index, [96, 0]] # 1: P2/4
  - [0, 1, Index, [192, 1]] # 2: P3/8
  - [0, 1, Index, [384, 2]] # 3: P4/16
  - [0, 1, Index, [768, 3]] # 4: P5/32

  # Top-down FPN path
  - [4, 1, nn.Upsample, [None, 2, "nearest"]] # 5
  - [[-1, 3], 1, Concat, [1]] # 6
  - [-1, 2, C2f, [384]] # 7

  - [7, 1, nn.Upsample, [None, 2, "nearest"]] # 8
  - [[-1, 2], 1, Concat, [1]] # 9
  - [-1, 2, C2f, [192]] # 10

  - [10, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 1], 1, Concat, [1]] # 12
  - [-1, 2, C2f, [96]] # 13 (P2/4-tiny)

  # Bottom-up PAN path
  - [13, 1, Conv, [96, 3, 2]] # 14
  - [[-1, 10], 1, Concat, [1]] # 15
  - [-1, 2, C2f, [192]] # 16 (P3/8-small)

  - [16, 1, Conv, [192, 3, 2]] # 17
  - [[-1, 7], 1, Concat, [1]] # 18
  - [-1, 2, C2f, [384]] # 19 (P4/16-medium)

  - [19, 1, Conv, [384, 3, 2]] # 20
  - [[-1, 4], 1, Concat, [1]] # 21
  - [-1, 2, C2f, [768]] # 22 (P5/32-large)

  - [[13, 16, 19, 22], 1, Detect, [nc]]
